Renova/src/Documents/ОтчетОПроизводстве/ОтчетОПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПроизводстве</name>
  <registerRecords>AccumulationRegister.Производство</registerRecords>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцПродаж</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/Catalogs/МоделиПродукции/МоделиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиПродукции</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииНоменклатуры</name>
    <type>
      <types>EnumRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Код7ки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/Documents/ОтчетОПроизводстве/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Товары.Очистить();
	
	// Переписываем данные из ТаблицыФорма в реквизит Документа
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;
    Префикс = ПолучитьПрефиксРеквизита();
    Для Каждого СтрокаДанных Из ТаблицаФормы Цикл
    	Если Не ЗначениеЗаполнено(СтрокаДанных.Модель) Тогда
    		Продолжить;
    	КонецЕсли;
        Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Значение   = СтрокаДанных[ИмяКолонки];
            Если СтрНачинаетсяС(ИмяКолонки, Префикс) Тогда
            	Инд = СтрНайти(ИмяКолонки, "_");
            	Если Инд > 0 Тогда
            		НоваяСтрока = ТекущийОбъект.Товары.Добавить();
    				НоваяСтрока.Номенклатура = СтрокаДанных.Модель;
    				НоваяСтрока.ВидПродукции = СтрокаДанных.ВидПродукции;
                	МесяцСтрока = Сред(ИмяКолонки, Инд + 1);
                	НоваяСтрока.МесяцПродаж = Дата(МесяцСтрока);
                	НоваяСтрока.Количество = Число(Значение);
                КонецЕсли;
            КонецЕсли;      
        КонецЦикла;    
    КонецЦикла;
   	ТекущийОбъект.Товары.Свернуть("Номенклатура,МесяцПродаж,ВидПродукции", "Количество");
   	
   	// Получаем списко видов продукции без повторений
   	ТаблицаВидовПродукции = ТекущийОбъект.Товары.Выгрузить( , "ВидПродукции");
   	ТаблицаВидовПродукции.Свернуть("ВидПродукции");
   	МассивВидовПродукции = ТаблицаВидовПродукции.ВыгрузитьКолонку("ВидПродукции");
   	ТекущийОбъект.СписокВидовПродукции = СтрСоединить(МассивВидовПродукции, ", ");
   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Создаем структуру таблицы
	ИзменитьТабличнуюЧасть();
	
	// Получаем соответствие дат начала месяца и имен колонок
	СоответствиеДатИКолонок = ПолучитьСоответствиеДатИКолонок();
	
	// Загружаем данные из реквизита Документа в ТаблицуФормы
	Для Каждого Товар Из ТекущийОбъект.Товары Цикл
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Модель", Товар.Номенклатура);
		МассивСтрок = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТаблицыФормы = ТаблицаФормы.Добавить();
			СтрокаТаблицыФормы.Модель = Товар.Номенклатура;
			СтрокаТаблицыФормы.ВидПродукции = Товар.ВидПродукции;
		Иначе
			СтрокаТаблицыФормы = МассивСтрок[0];		
		КонецЕсли;
		// Ищем колонку в соответствии
		ИмяКолонки = СоответствиеДатИКолонок.Получить(Товар.МесяцПродаж);
		Если ИмяКолонки <> Неопределено Тогда
			СтрокаТаблицыФормы[ИмяКолонки] = Товар.Количество;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСтроковыеЗначенияПериода();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораМесяца(Объект.НачалоПериода, "Начало периода",
		"ПослеВыбораНачалоПериода");
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораМесяца(Объект.КонецПериода, "Конец периода",
		"ПослеВыбораКонецПериода");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФормы

&НаКлиенте
Процедура ТаблицаФормыМодельПриИзменении(Элемент)
	ТекущаяСтрокаДанных = Элементы.ТаблицаФормы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущаяСтрокаДанных.Модель) Тогда
		ТекущаяСтрокаДанных.ВидПродукции = ПолучитьВидПродукции(ТекущаяСтрокаДанных.Модель);
	Иначе
		ТекущаяСтрокаДанных.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьДанные(Команда) 
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Текстовые файлы (*.txt)|*.txt";
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	ИмяФайла = Диалог.ПолноеИмяФайла;
	
	ПрочитатьФайлПродаж(ИмяФайла);  
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораМесяца(НачальнаяДата, ЗаголовокФормы, ИмяМетода)
	Оповещение = Новый ОписаниеОповещения(ИмяМетода, ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачальнаяДата", НачальнаяДата);
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораМесяца", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор, , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПрефиксРеквизита()
	Возврат "tmp";
КонецФункции

&НаСервере
Процедура ИзменитьТабличнуюЧасть()
	Если Объект.КонецПериода < Объект.НачалоПериода Тогда
		ВызватьИсключение "Конец периода меньше начала периода!";
	КонецЕсли;
	
	// Удаляем ранее добавленные элементы и реквизиты по префиксу
	УдалитьПрограммноДобавленыеЭлементыИРеквизиты();
	
	// Подготавливаем списко добавляемых колонок
	КоличествоКолонок = (Месяц(Объект.КонецПериода) - Месяц(Объект.НачалоПериода))	
		+ (Год(Объект.КонецПериода) - Год(Объект.НачалоПериода)) * 12 + 1;
	СписокКолонок = Новый Массив;
	ТекМесяц = НачалоМесяца(Объект.НачалоПериода);
	Префикс = ПолучитьПрефиксРеквизита();
	Для Сч = 1 По КоличествоКолонок Цикл
		НоваяКолонка = Новый Структура();
		ИмяКолонки = СтрШаблон("%1%2_%3", Префикс, НумераторРеквизитов, Формат(ТекМесяц, "ДФ=yyyyMMdd;"));
		НоваяКолонка.Вставить("Имя", ИмяКолонки);
		НоваяКолонка.Вставить("Заголовок", Формат(ТекМесяц, "ДФ='MMMM yyyy';"));
		СписокКолонок.Добавить(НоваяКолонка);	
		ТекМесяц = НачалоМесяца(ДобавитьМесяц(ТекМесяц, 1));
	КонецЦикла;
	
	// Добавляем реквизиты формы	
	ДобавляемыеРеквизиты = Новый Массив;
	КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный);
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Число",  КвалификаторыЧисла);
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		НовыйРеквизит = Новый РеквизитФормы(НоваяКолонка.Имя, ОписаниеТипаКолонки,
			"ТаблицаФормы", НоваяКолонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	Для Каждого НоваяКолонка Из СписокКолонок Цикл
		ЭлементКолонка = Элементы.Добавить(НоваяКолонка.Имя, Тип("ПолеФормы"),
			Элементы["ТаблицаФормы"]);
		ЭлементКолонка.Заголовок = НоваяКолонка.Заголовок;
    	ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + НоваяКолонка.Имя;
    	ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	// Добавляем пустую колонку в конце для красоты таблицы
	ДобавитьПустоеПолеВТабличнуюЧасть();
	
	// Увеличиваем позицию нумератора
	НумераторРеквизитов = НумераторРеквизитов  + 1;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПустоеПолеВТабличнуюЧасть()
	// Добавляем реквизит формы	
	ИмяКолонки = СтрШаблон("%1%2%3", ПолучитьПрефиксРеквизита(), НумераторРеквизитов, "decoration");
	ДобавляемыеРеквизиты = Новый Массив;
    ОписаниеТипаКолонки = Новый ОписаниеТипов("Строка",  Новый КвалификаторыСтроки(10));
	НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ОписаниеТипаКолонки,
		"ТаблицаФормы");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляем элементы формы
	ЭлементКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"),
		Элементы["ТаблицаФормы"]);
	ЭлементКолонка.Заголовок = Символ(32);
	ЭлементКолонка.ТолькоПросмотр = Истина;
    ЭлементКолонка.ПутьКДанным = "ТаблицаФормы." + ИмяКолонки;
    ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПрограммноДобавленыеЭлементыИРеквизиты()
	Префикс = ПолучитьПрефиксРеквизита();
	
	// Удаляем элементы Формы	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И СтрНачинаетсяС(ЭлементФормы.Имя, Префикс) Тогда
			УдаляемыеЭлементы.Добавить(ЭлементФормы);
		КонецЕсли
	КонецЦикла;
	Для Каждого ЭлементФормы Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;
	
	// Удаляем реквизиты
	РеквизитыФормы = ПолучитьРеквизиты();
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого РевизитФормы Из РеквизитыФормы Цикл
		Если СтрНачинаетсяС(РевизитФормы.Имя, Префикс) Тогда
			УдаляемыеРеквизиты.Добавить(РевизитФормы);
		КонецЕсли
	КонецЦикла;
	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
        ИзменитьРеквизиты( , УдаляемыеРеквизиты);
    КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидПродукции(МодельСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка.ВидПродукции КАК ВидПродукции
		|ИЗ
		|	Справочник.МоделиПродукции КАК МоделиПродукции
		|ГДЕ
		|	Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", МодельСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	    Возврат Выборка.ВидПродукции;
	КонецЕсли;
	
	Возврат Справочники.ВидыПродукции.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеДатИКолонок()
	КолонкиТаблицы = ТаблицаФормы.Выгрузить().Колонки;	
	СоответствиеДат = Новый Соответствие;
	
	МесяцТек = Объект.НачалоПериода;
	Пока МесяцТек <= Объект.КонецПериода Цикл
		МесяцСтрока = Формат(МесяцТек, "ДФ=yyyyMMdd;");
		Для Каждого Колонка Из КолонкиТаблицы Цикл
            ИмяКолонки = Колонка.Имя;
            Если СтрНайти(ИмяКолонки,МесяцСтрока) > 0 Тогда
            	СоответствиеДат.Вставить(МесяцТек, ИмяКолонки);	
            КонецЕсли;      
		КонецЦикла;	
		МесяцТек = ДобавитьМесяц(МесяцТек, 1);
	КонецЦикла;
	
	Возврат СоответствиеДат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораНачалоПериода(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.НачалоПериода = Результат;
		Если Объект.НачалоПериода > Объект.КонецПериода Тогда
			Объект.КонецПериода = Объект.НачалоПериода;
		КонецЕсли;
		УстановитьСтроковыеЗначенияПериода();
		ИзменитьТабличнуюЧасть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонецПериода(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.КонецПериода = Результат;
		Если Объект.КонецПериода < Объект.НачалоПериода Тогда
			Объект.НачалоПериода = Объект.КонецПериода;
		КонецЕсли;
		УстановитьСтроковыеЗначенияПериода();
		ИзменитьТабличнуюЧасть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтроковыеЗначенияПериода()
	НачалоПериодаСтрока = Формат(Объект.НачалоПериода, "ДФ='MMMM yyyy';");
	КонецПериодаСтрока = Формат(Объект.КонецПериода, "ДФ='MMMM yyyy';");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлПродаж(ПутьФайла, Кодировка = Неопределено) Экспорт

    Если Кодировка = Неопределено Тогда
        Кодировка = КодировкаТекста.UTF8;
    КонецЕсли;
	
	    // Используем ЧтениеТекста для последовательного чтения
    Чтение = Новый ЧтениеТекста(ПутьФайла, Кодировка); 
	
    Попытка
        // Чтение заголовка (первые 4 строки)
		СтрокиЗаголовка = Новый Массив;
        Для Индекс = 1 По 4 Цикл
            Стр = Чтение.ПрочитатьСтроку();
            Если Стр = Неопределено Тогда
                ВызватьИсключение "Файл содержит менее 4 строк";
            КонецЕсли;
            СтрокиЗаголовка.Добавить(Стр);
        КонецЦикла;
        
        // Извлечение периода
        СтрокаПериода = СтрокиЗаголовка[2];
        Части = СтрРазделить(СтрокаПериода, Символы.Таб, Ложь);
        Если Части.Количество() < 2 Тогда
            ВызватьИсключение "Не удалось извлечь даты периода";
        КонецЕсли;
        
        Объект.НачалоПериода = ПреобразоватьДатуИзДвузначногоГода(СокрЛП(Части[0]));
        Объект.КонецПериода   = ПреобразоватьДатуИзДвузначногоГода(СокрЛП(Части[1]));
        
        // Обновление формы и создание колонок
        УстановитьСтроковыеЗначенияПериода();
        ИзменитьТабличнуюЧасть();   // создаёт колонки по месяцам
        
        // ПОЛУЧАЕМ СООТВЕТСТВИЕ ДАТ И КОЛОНОК 
        СоответствиеДатКолонок = ПолучитьСоответствиеДатИКолонок();
        
        // Чтение данных 
		ДанныеПоКодам = Новый Соответствие; // Ключ - код, значение - массив количеств
        
        Пока Истина Цикл
            Стр = Чтение.ПрочитатьСтроку();
            Если Стр = Неопределено Тогда Прервать; КонецЕсли;
            Если ПустаяСтрока(Стр) Тогда Продолжить; КонецЕсли;
            
            ЧастиСтроки = СтрРазделить(Стр, Символы.Таб, Истина);
            Если ЧастиСтроки.Количество() < 2 Тогда Продолжить; КонецЕсли;
            
            Код = СокрЛП(ЧастиСтроки[0]);
			Если ПустаяСтрока(Код) Тогда 
				Продолжить; 
			КонецЕсли;
            
            Количества = Новый Массив;
            Для Инд = 2 По ЧастиСтроки.Количество() - 1 Цикл
                Попытка
                    Количества.Добавить(Число(ЧастиСтроки[Инд]));
                Исключение
                    Количества.Добавить(0);
                КонецПопытки;
            КонецЦикла;
            
            ДанныеПоКодам[Код] = Количества;
        КонецЦикла;
        
        Чтение.Закрыть();
        
        // Получение ссылок на модели по кодам 
		МассивКодов = Новый Массив;
        Для каждого Элемент Из ДанныеПоКодам Цикл
            МассивКодов.Добавить(Элемент.Ключ);
        КонецЦикла;
        СоответствиеКодМодель = ПолучитьМоделиПоКодам(МассивКодов);
		
        // Заполнение таблицы формы
		ТаблицаФормы.Очистить();
        МассивДат = ПолучитьМассивДатМесяцев(Объект.НачалоПериода, Объект.КонецПериода);
        
        Для каждого Элемент Из ДанныеПоКодам Цикл
            Код = Элемент.Ключ;
            Количества = Элемент.Значение;
            ДанныеМодели = СоответствиеКодМодель.Получить(Код);
            Если ДанныеМодели = Неопределено Тогда
                Сообщить("Не найдена модель с кодом " + Код);
                Продолжить;
            КонецЕсли;
            
            НоваяСтрока = ТаблицаФормы.Добавить();
            НоваяСтрока.Модель = ДанныеМодели.Ссылка;
            НоваяСтрока.ВидПродукции = ДанныеМодели.ВидПродукции;
            
            Для Индекс = 0 По МассивДат.ВГраница() Цикл
                ИмяКолонки = СоответствиеДатКолонок.Получить(МассивДат[Индекс]);
                Если ИмяКолонки <> Неопределено И Индекс < Количества.Количество() Тогда
                    НоваяСтрока[ИмяКолонки] = Количества[Индекс];
                КонецЕсли;
            КонецЦикла;
        КонецЦикла;
        
        Сообщить("Загрузка завершена. Добавлено строк: " + ТаблицаФормы.Количество());
        
    Исключение
        Чтение.Закрыть();
        Сообщить("Ошибка: " + ОписаниеОшибки());
    КонецПопытки;
	    
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивДатМесяцев(ДатаНачала, ДатаОкончания)

	Месяцы = Новый Массив;
	ТекДата = ДатаНачала;
	Пока ТекДата <= ДатаОкончания Цикл
		Месяцы.Добавить(ТекДата);
		ТекДата = ДобавитьМесяц(ТекДата, 1);
	КонецЦикла;
	Возврат Месяцы;

КонецФункции

// Преобразует строку даты с двузначным годом в тип Дата.
// Параметры:
//   СтрокаДаты - Строка - в формате "ДД.ММ.ГГ"
// Возвращаемое значение:
//   Дата 
&НаСервереБезКонтекста
Функция ПреобразоватьДатуИзДвузначногоГода(СтрокаДаты)
    Части = СтрРазделить(СтрокаДаты, ".", Ложь);
    Если Части.Количество() <> 3 Тогда
        ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный формат даты: %1'"), СтрокаДаты);
    КонецЕсли;
    День   = Число(Части[0]);
    Месяц  = Число(Части[1]);
    Год    = Число(Части[2]);
    // Интерпретация двухзначного года: 00-29 -> 2000-2029, 30-99 -> 1930-1999 (стандарт 1С)
    ПолныйГод = Год;
    Если Год < 30 Тогда
        ПолныйГод = 2000 + Год;
    ИначеЕсли Год < 100 Тогда
        ПолныйГод = 1900 + Год;
    КонецЕсли;
    Возврат Дата(ПолныйГод, Месяц, День);
КонецФункции

&НаСервере
Функция ПолучитьМоделиПоКодам(МассивКодов)

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МоделиПродукции.Код7ки КАК Код,
	               |	МоделиПродукции.Ссылка КАК Ссылка,
	               |	МоделиПродукции.ВидПродукции КАК ВидПродукции
	               |ИЗ
	               |	Справочник.МоделиПродукции КАК МоделиПродукции
	               |ГДЕ
	               |	МоделиПродукции.Код7ки В(&Коды)";

	Запрос.УстановитьПараметр("Коды", МассивКодов);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура("Ссылка, ВидПродукции", Выборка.Ссылка, Выборка.ВидПродукции);
		Результат.Вставить(Выборка.Код, СтруктураДанных);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
